cooking.org
#+TITLE: Cooking
#+DESCRIPTION: This is my cooking guide looking to replace this part on evernote with org.
#+AUTHOR: Tobin Stultiens
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: tags:nil

* Recipes
** Salsa :Mexican:Sauce:
Got the recipe from this [[https://www.youtube.com/watch?v=Upqp21Dm5vg][video]].

- 2-3 large, ripe tomatoes - firm, fragrant, preferably on the vine
- 1 medium red onion
- Cilantro (very optional, substitute with parsley if you're like me)
- 1 Jalapeño
- Fresh garlic (1 clove)
- Kosher salt
- Freshly ground pepper
- 1 red bell pepper (optional)
- 1 mango (optional) - soft but not mushy to the touch
- Scallions, aka green onions (one)

** Focaccia Sandwich and Pizza :Bread:Pizza:Sandwich:
This [[https://www.youtube.com/watch?v=eq8vuOSnV68][video]] seemed interesting about how they make use of focaccia

** Focaccia Bread :Bread:
This [[https://www.youtube.com/watch?v=HTD-z1wd0tw&t=0s][video]] seemed like an easy way to make this bread

** Flour Tortillas :Bread:Mexican:
I have attempted to make these once they were quite succesful I only struggled with making them round I hope this [[https://youtu.be/j0gjlSgO7VU?t=64][video]] helps me with how to roll them next time.
The [[https://thecafesucrefarine.com/best-ever-homemade-flour-tortillas/][recipe]] I followed when I was making them.
|--------+---------------+----------+---------------+------------------------+------------|
| Amount | Platent bloem | Zout     | Baking powder | Extra virgin olive oil | Warm water |
|--------+---------------+----------+---------------+------------------------+------------|
|     16 | 375g          | 5g       | 5g            | 80ml                   | 240ml      |
|      1 | 23.4375 g     | 0.3125 g | 0.3125 g      | 5 ml                   | 15 ml      |
|     22 | 515.625 g     | 6.875 g  | 6.875 g       | 110 ml                 | 330 ml     |
|--------+---------------+----------+---------------+------------------------+------------|
#+TBLFM: @3=@-1/@2$1::@4$2..@4$6=@-1*$1

** Miso Soup :Soup:Japanese:
This [[https://minimalistbaker.com/15-minute-miso-soup-with-greens-and-tofu/][recipe]] looked interesting

** Pickled Onions :Pickled:
This is quite a nice acidic [[https://www.youtube.com/watch?v=K4HbmPu_M_4&t=24s][recipe]].

** Poblano con queso taco :Mexican:Cheese:Taco:
This [[https://youtu.be/YtkyC2Ctz6E][recipe]] looked interesting.

** How to pimp my noodles :Noodles:
This is a simple guid on how to pimp your [[https://www.budgetbytes.com/6-ways-to-upgrade-instant-ramen/][noodle]].

** Crispy Baked wings :Chicken:Wings:
This just looks [[https://www.youtube.com/watch?v=mh2AXh1eRmE][good]].

** PK Chicken Karahi :Chicken:
[[https://www.youtube.com/watch?v=4PMmH2-5wJM][link]]

** Calzone :Italian:Pizza:
[[https://www.youtube.com/watch?v=PrbpuNZyoUQ][link]]

** Chicken Enchiladas :Chicken:Mexican:
[[https://www.lekkerensimpel.com/enchiladas-met-kip/][The boring one]]
[[https://www.allrecipes.com/recipe/8691/chicken-enchiladas-i][Spicy one]]
Maybe watch out with the chili powder on this one.

** Cheese dip :Cheese:Dip:
[[https://www.youtube.com/watch?v=PTbdvND_YLQ][Sodium Citrate]]
This looks like a better way to make a dip.

** Rice :Rice:
|---------------+---------|
| Rijst         | Water   |
|---------------+---------|
| Sushi Rijst   | 1 + 1/3 |
|---------------+---------|
| Normale Rijst | 1 + 1/2 |
|---------------+---------|

** Stir Fry :Template:Wok:
Required:
- Garlic
- Ginger

Optional:
Vegetable:
- Mushroom
- Onion
- Red pepper
- Spring onion
- Peppers

Meat:
- Chicken
- Pork
- Beef

Sauces:
- Teriyaki Sauce
- Soy based sauce

** Korean Fried Chicken :Chicken:Korean:Frying:
[[https://sorted.club/recipe/korean-fried-sweet-and-sour-chicken-with-sesame-sticky-rice/][Link of idea]]
[[https://dinnerthendessert.com/korean-fried-chicken/][Link of the sauce]]

** Teriyaki Sauce :Sauce:Japanese:
