cooking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-23 di 16:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cooking</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tobin Stultiens" />
<meta name="description" content="This is my cooking guide looking to replace this part on evernote with org."
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Cooking</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org12e5bb7">1. Recipes</a>
<ul>
<li><a href="#org3e0b572">1.1. Salsa</a></li>
<li><a href="#org083cfbe">1.2. Focaccia Sandwich and Pizza</a></li>
<li><a href="#orgb2a623e">1.3. Focaccia Bread</a></li>
<li><a href="#org833c47f">1.4. Flour Tortillas</a></li>
<li><a href="#org7c18dfe">1.5. Miso Soup</a></li>
<li><a href="#org7ccc497">1.6. Pickled Onions</a></li>
<li><a href="#org4b2b3c9">1.7. Poblano con queso taco</a></li>
<li><a href="#org14bac4c">1.8. How to pimp my noodles</a></li>
<li><a href="#org7842f52">1.9. Crispy Baked wings</a></li>
<li><a href="#orgdf4446e">1.10. PK Chicken Karahi</a></li>
<li><a href="#org4d70ad2">1.11. Calzone</a></li>
<li><a href="#org12441aa">1.12. Chicken Enchiladas</a></li>
<li><a href="#org5f81c12">1.13. Cheese dip</a></li>
<li><a href="#orgbb75578">1.14. Rice</a></li>
<li><a href="#org2c5b992">1.15. Stir Fry</a></li>
<li><a href="#orga852a8d">1.16. Korean Fried Chicken</a></li>
<li><a href="#org2c36cb1">1.17. Teriyaki Sauce</a>
<ul>
<li><a href="#org596a701">1.17.1. 3 Ingredient Version</a></li>
<li><a href="#orgc4536c2">1.17.2. Improved version</a></li>
<li><a href="#org066437a">1.17.3. Storing version</a></li>
</ul>
</li>
<li><a href="#org11f1ed9">1.18. Spicy Sesame Rice Bowl</a></li>
<li><a href="#orgce5108e">1.19. zha jiang min</a></li>
<li><a href="#org0d835fb">1.20. Sesame Beef</a></li>
<li><a href="#orgdae4c26">1.21. Burritos</a></li>
<li><a href="#orgb6e2927">1.22. Easy Mexican Casserole</a></li>
<li><a href="#orga627ce5">1.23. Black pepper beef</a></li>
<li><a href="#orgaa14206">1.24. Wraps</a>
<ul>
<li><a href="#org3215b86">1.24.1. Kipfilet variant </a></li>
<li><a href="#org36d8bbc">1.24.2. Groenten wrap </a></li>
<li><a href="#orgdbf8a53">1.24.3. Wrap met kip, sla en komkommer </a></li>
</ul>
</li>
<li><a href="#orgf570419">1.25. Stokbrood met pittig gehakt</a></li>
<li><a href="#orgb03ec40">1.26. Quesedillas</a></li>
<li><a href="#orgc2654ae">1.27. Sweet and sour chicken</a></li>
<li><a href="#orgdac3044">1.28. Spicy Thai Basil chicken</a></li>
<li><a href="#orgf9b9c33">1.29. Garlic sauce</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org12e5bb7" class="outline-2">
<h2 id="org12e5bb7"><span class="section-number-2">1</span> Recipes</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3e0b572" class="outline-3">
<h3 id="org3e0b572"><span class="section-number-3">1.1</span> Salsa</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Got the recipe from this <a href="https://www.youtube.com/watch?v=Upqp21Dm5vg">video</a>.
</p>

<ul class="org-ul">
<li>2-3 large, ripe tomatoes - firm, fragrant, preferably on the vine</li>
<li>1 medium red onion</li>
<li>Cilantro (very optional, substitute with parsley if you&rsquo;re like me)</li>
<li>1 Jalapeño</li>
<li>Fresh garlic (1 clove)</li>
<li>Kosher salt</li>
<li>Freshly ground pepper</li>
<li>1 red bell pepper (optional)</li>
<li>1 mango (optional) - soft but not mushy to the touch</li>
<li>Scallions, aka green onions (one)</li>
</ul>
</div>
</div>
<div id="outline-container-org083cfbe" class="outline-3">
<h3 id="org083cfbe"><span class="section-number-3">1.2</span> Focaccia Sandwich and Pizza</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This <a href="https://www.youtube.com/watch?v=eq8vuOSnV68">video</a> seemed interesting about how they make use of focaccia
</p>
</div>
</div>

<div id="outline-container-orgb2a623e" class="outline-3">
<h3 id="orgb2a623e"><span class="section-number-3">1.3</span> Focaccia Bread</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This <a href="https://www.youtube.com/watch?v=HTD-z1wd0tw&amp;t=0s">video</a> seemed like an easy way to make this bread
</p>
</div>
</div>

<div id="outline-container-org833c47f" class="outline-3">
<h3 id="org833c47f"><span class="section-number-3">1.4</span> Flour Tortillas</h3>
<div class="outline-text-3" id="text-1-4">
<p>
I have attempted to make these once they were quite succesful I only struggled with making them round I hope this <a href="https://youtu.be/j0gjlSgO7VU?t=64">video</a> helps me with how to roll them next time.
The <a href="https://thecafesucrefarine.com/best-ever-homemade-flour-tortillas/">recipe</a> I followed when I was making them.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Amount</th>
<th scope="col" class="org-left">Platent bloem</th>
<th scope="col" class="org-left">Zout</th>
<th scope="col" class="org-left">Baking powder</th>
<th scope="col" class="org-left">Extra virgin olive oil</th>
<th scope="col" class="org-left">Warm water</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">16</td>
<td class="org-left">375g</td>
<td class="org-left">5g</td>
<td class="org-left">5g</td>
<td class="org-left">80ml</td>
<td class="org-left">240ml</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">23.4375 g</td>
<td class="org-left">0.3125 g</td>
<td class="org-left">0.3125 g</td>
<td class="org-left">5 ml</td>
<td class="org-left">15 ml</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-left">515.625 g</td>
<td class="org-left">6.875 g</td>
<td class="org-left">6.875 g</td>
<td class="org-left">110 ml</td>
<td class="org-left">330 ml</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7c18dfe" class="outline-3">
<h3 id="org7c18dfe"><span class="section-number-3">1.5</span> Miso Soup</h3>
<div class="outline-text-3" id="text-1-5">
<p>
This <a href="https://minimalistbaker.com/15-minute-miso-soup-with-greens-and-tofu/">recipe</a> looked interesting
</p>
</div>
</div>

<div id="outline-container-org7ccc497" class="outline-3">
<h3 id="org7ccc497"><span class="section-number-3">1.6</span> Pickled Onions</h3>
<div class="outline-text-3" id="text-1-6">
<p>
This is quite a nice acidic <a href="https://www.youtube.com/watch?v=K4HbmPu_M_4&amp;t=24s">recipe</a>.
</p>
</div>
</div>

<div id="outline-container-org4b2b3c9" class="outline-3">
<h3 id="org4b2b3c9"><span class="section-number-3">1.7</span> Poblano con queso taco</h3>
<div class="outline-text-3" id="text-1-7">
<p>
This <a href="https://youtu.be/YtkyC2Ctz6E">recipe</a> looked interesting.
</p>
</div>
</div>

<div id="outline-container-org14bac4c" class="outline-3">
<h3 id="org14bac4c"><span class="section-number-3">1.8</span> How to pimp my noodles</h3>
<div class="outline-text-3" id="text-1-8">
<p>
This is a simple guid on how to pimp your <a href="https://www.budgetbytes.com/6-ways-to-upgrade-instant-ramen/">noodle</a>.
</p>
</div>
</div>

<div id="outline-container-org7842f52" class="outline-3">
<h3 id="org7842f52"><span class="section-number-3">1.9</span> Crispy Baked wings</h3>
<div class="outline-text-3" id="text-1-9">
<p>
This just looks <a href="https://www.youtube.com/watch?v=mh2AXh1eRmE">good</a>.
</p>
</div>
</div>

<div id="outline-container-orgdf4446e" class="outline-3">
<h3 id="orgdf4446e"><span class="section-number-3">1.10</span> PK Chicken Karahi</h3>
<div class="outline-text-3" id="text-1-10">
<p>
<a href="https://www.youtube.com/watch?v=4PMmH2-5wJM">link</a>
</p>
</div>
</div>

<div id="outline-container-org4d70ad2" class="outline-3">
<h3 id="org4d70ad2"><span class="section-number-3">1.11</span> Calzone</h3>
<div class="outline-text-3" id="text-1-11">
<p>
<a href="https://www.youtube.com/watch?v=PrbpuNZyoUQ">link</a>
</p>
</div>
</div>

<div id="outline-container-org12441aa" class="outline-3">
<h3 id="org12441aa"><span class="section-number-3">1.12</span> Chicken Enchiladas</h3>
<div class="outline-text-3" id="text-1-12">
<p>
<a href="https://www.lekkerensimpel.com/enchiladas-met-kip/">The boring one</a>
<a href="https://www.allrecipes.com/recipe/8691/chicken-enchiladas-i">Spicy one</a>
Maybe watch out with the chili powder on this one.
</p>
</div>
</div>

<div id="outline-container-org5f81c12" class="outline-3">
<h3 id="org5f81c12"><span class="section-number-3">1.13</span> Cheese dip</h3>
<div class="outline-text-3" id="text-1-13">
<p>
<a href="https://www.youtube.com/watch?v=PTbdvND_YLQ">Sodium Citrate</a>
This looks like a better way to make a dip.
</p>
</div>
</div>

<div id="outline-container-orgbb75578" class="outline-3">
<h3 id="orgbb75578"><span class="section-number-3">1.14</span> Rice</h3>
<div class="outline-text-3" id="text-1-14">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Rijst</th>
<th scope="col" class="org-left">Water</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Sushi Rijst</td>
<td class="org-left">1 + 1/3</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Normale Rijst</td>
<td class="org-left">1 + 1/2</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2c5b992" class="outline-3">
<h3 id="org2c5b992"><span class="section-number-3">1.15</span> Stir Fry</h3>
<div class="outline-text-3" id="text-1-15">
<p>
Required:
</p>
<ul class="org-ul">
<li>Garlic</li>
<li>Ginger</li>
</ul>

<p>
Optional:
Vegetable:
</p>
<ul class="org-ul">
<li>Mushroom</li>
<li>Onion</li>
<li>Red pepper</li>
<li>Spring onion</li>
<li>Peppers</li>
</ul>

<p>
Meat:
</p>
<ul class="org-ul">
<li>Chicken</li>
<li>Pork</li>
<li>Beef</li>
</ul>

<p>
Sauces:
</p>
<ul class="org-ul">
<li>Teriyaki Sauce</li>
<li>Soy based sauce</li>
</ul>
</div>
</div>

<div id="outline-container-orga852a8d" class="outline-3">
<h3 id="orga852a8d"><span class="section-number-3">1.16</span> Korean Fried Chicken</h3>
<div class="outline-text-3" id="text-1-16">
<p>
<a href="https://sorted.club/recipe/korean-fried-sweet-and-sour-chicken-with-sesame-sticky-rice/">Link of idea</a>
<a href="https://dinnerthendessert.com/korean-fried-chicken/">Link of the sauce</a>
</p>
</div>
</div>
