cooking.html

<div id="outline-container-org2c36cb1" class="outline-3">
<h3 id="org2c36cb1"><span class="section-number-3">1.17</span> Teriyaki Sauce</h3>
<div class="outline-text-3" id="text-1-17">
</div>
<div id="outline-container-org596a701" class="outline-4">
<h4 id="org596a701"><span class="section-number-4">1.17.1</span> 3 Ingredient Version</h4>
<div class="outline-text-4" id="text-1-17-1">
<p>
Basic teriyaki sauce
</p>

<p>
Ingredients: 
</p>
<ul class="org-ul">
<li>1/3 cup Japanese mirin (sweet rice wine) </li>
<li>2 tablespoons soy sauce, low sodium preferred </li>
<li>1 tablespoon sugar </li>
</ul>

<p>
Instructions:
</p>
<ol class="org-ol">
<li>Combine all the ingredients of the Teriyaki Sauce in a sauce pan. On low heat, simmer and reduce it to a thicker consistency, about 10 minutes.</li>
</ol>

<p>
<a href="https://www.tasteandtellblog.com/teriyaki-chicken/">Another way to make teriyaki sauce</a>
<a href="https://www.bbcgoodfood.com/recipes/teriyaki-sauce">Fridge sauce</a>
</p>
</div>
</div>

<div id="outline-container-orgc4536c2" class="outline-4">
<h4 id="orgc4536c2"><span class="section-number-4">1.17.2</span> Improved version</h4>
<div class="outline-text-4" id="text-1-17-2">
<p>
Basic teriyaki sauce
</p>

<p>
Ingredients: 
</p>
<ul class="org-ul">
<li>1/3 cup Japanese mirin (sweet rice wine) </li>
<li>2 tablespoons soy sauce, low sodium preferred </li>
<li>1 tablespoon sugar </li>
<li>1-2 tablespoons honey</li>
<li>1 cloves garlic</li>
</ul>

<p>
Instructions:
</p>
<ol class="org-ol">
<li>Combine all the ingredients of the Teriyaki Sauce in a sauce pan. On low heat, simmer and reduce it to a thicker consistency, about 10 minutes.</li>
</ol>

<p>
<a href="https://www.tasteandtellblog.com/teriyaki-chicken/">Another way to make teriyaki sauce</a>
</p>
</div>
</div>

<div id="outline-container-org066437a" class="outline-4">
<h4 id="org066437a"><span class="section-number-4">1.17.3</span> Storing version</h4>
<div class="outline-text-4" id="text-1-17-3">
<p>
Ingredients: 
</p>
<ul class="org-ul">
<li>1/3 cup Japanese mirin (sweet rice wine) </li>
<li>2 tablespoons soy sauce, low sodium preferred </li>
<li>1 tablespoon sugar </li>
<li>1-2 tablespoons honey</li>
<li>1 cloves garlic</li>
</ul>

<p>
<a href="https://www.bbcgoodfood.com/recipes/teriyaki-sauce">Fridge sauce</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org11f1ed9" class="outline-3">
<h3 id="org11f1ed9"><span class="section-number-3">1.18</span> Spicy Sesame Rice Bowl</h3>
<div class="outline-text-3" id="text-1-18">
<p>
<a href="https://www.goodhousekeeping.com/food-recipes/a42379/spicy-sesame-rice-bowls-recipe/">Link</a>
</p>

<p>
Heb Korean red pepper paste vervangen door sambal oelek met wat maizena om het te verdikken 
 
Dit is heel goed gelukt 
 
Kogelbiefstuk is hiervoor aangeraden.
</p>
</div>
</div>

<div id="outline-container-orgce5108e" class="outline-3">
<h3 id="orgce5108e"><span class="section-number-3">1.19</span> zha jiang min</h3>
<div class="outline-text-3" id="text-1-19">
<p>
<a href="https://youtu.be/NM4ArR-qbHQ">Link</a>
1-Hour Noodles 
Servings: 2 
 
Ingredients 
2 tablespoons plus 1 teaspoon vegetable oil, divided 
1 tablespoon plus 1 teaspoon minced garlic, divided 
1 tablespoon minced fresh ginger 
1 tablespoon minced shallot 
4 ounces 80/20 ground pork 
1 tablespoon fermented soy bean paste 
1 tablespoon sweet bean sauce 
1 teaspoon dark soy sauce 
¼ cup cornstarch slurry (8 teaspoons cornstarch mixed with 4 teaspoons water) 
1 large egg, beaten 
360 grams fresh noodle of choice 
1 Persian cucumber, thinly sliced 
½ cup fresh cilantro leaves 
 
Preparation 
In  a medium pan, heat 1 tablespoon of vegetable oil over medium heat. Add 1  tablespoon of minced garlic, the ginger, and shallot and sauté until  lightly aromatic, 1-2 minutes. Add the ground pork to the pan and cook,  undisturbed, until golden brown, 3-5 minutes.  
Meanwhile,  in a small pan, heat another tablespoon of vegetable oil over  medium-low heat. Add the soy bean paste and sweet bean sauce and cook  until caramelized, 1-2 minutes, being careful not to burn. 
Add  the caramelized bean paste mixture to the ground pork mixture and stir  to combine. Add the soy sauce and cook for another 30 seconds to  incorporate. Add the cornstarch slurry, reduce the heat to low, and  simmer for about 15 minutes, adding a few tablespoons of water at a time  as needed to keep the mixture at a simmer. 
Meanwhile,  heat a small pan over low heat. Add the remaining  teaspoon of  vegetable oil, then pour in the egg and tilt the pan to spread in a thin  layer. Cook until the top is just set, then remove the egg crepe from  the pan. Let cool, then thinly slice. 
Cook the noodles according to the package instructions, then drain.  
Place  the cooked noodles in a serving bowl and top with the ground pork  mixture. Garnish with the egg crepe strips, cucumber, cilantro, and  remaining teaspoon of minced garlic. 
Enjoy! 
</p>
</div>
</div>

<div id="outline-container-org0d835fb" class="outline-3">
<h3 id="org0d835fb"><span class="section-number-3">1.20</span> Sesame Beef</h3>
<div class="outline-text-3" id="text-1-20">
<p>
<a href="https://www.allrecipes.com/recipe/14679/sesame-beef/">Link</a>
Ingredients: 
</p>
<ul class="org-ul">
<li>1 pound round steak </li>
<li>4 tablespoons soy sauce </li>
<li>4 tablespoons white sugar </li>
<li>4 tablespoons vegetable oil </li>
<li>2 cloves garlic, minced </li>
<li>2 green onions, chopped </li>
<li>2 tablespoons sesame seeds </li>
</ul>
<p>
 
Directions: 
 
</p>
<ol class="org-ol">
<li>Mix soy sauce, sugar, oil, garlic, and onions in a large bowl. Set aside. </li>
<li>Cut steak into strips and add to bowl. Cover and refrigerate overnight, or at least 30 minutes. </li>
<li>Cook in wok or frying pan until brown, about 5 minutes. Add sesame seeds and cook for additional 2 minutes. </li>
</ol>
</div>
</div>

<div id="outline-container-orgdae4c26" class="outline-3">
<h3 id="orgdae4c26"><span class="section-number-3">1.21</span> Burritos</h3>
<div class="outline-text-3" id="text-1-21">
<p>
ESSENTIAL INGREDIENTS 
</p>
<ul class="org-ul">
<li>Rundergehakt 700-800 gram </li>
<li>Mais </li>
<li>Paprika </li>
<li>Onions </li>
<li>Wrap </li>
<li>Cheese </li>
<li>Creme fraiche </li>
</ul>
<p>
 
POSSIBLE INGREDIENTS 
</p>
<ul class="org-ul">
<li>Chili Pepers </li>
<li>Knoflook </li>
<li>Tomaat </li>
<li>Champignons </li>
<li>Sla </li>
</ul>
<p>
 
Spices: 
</p>
<ul class="org-ul">
<li>Taco</li>
</ul>
</div>
</div>

<div id="outline-container-orgb6e2927" class="outline-3">
<h3 id="orgb6e2927"><span class="section-number-3">1.22</span> Easy Mexican Casserole</h3>
<div class="outline-text-3" id="text-1-22">
<p>
<a href="https://www.allrecipes.com/recipe/20680/easy-mexican-casserole/">Link</a>
 
</p>
<ul class="org-ul">
<li>1 pound lean ground beef </li>
<li>2 cups salsa </li>
<li>1 (16 ounce) can chili beans, drained </li>
<li>3 cups tortilla chips, crushed </li>
<li>2 cups sour cream </li>
<li>1 (2 ounce) can sliced black olives, drained </li>
<li>1/2 cup chopped green onion </li>
<li>1/2 cup chopped fresh tomato </li>
<li>2 cups shredded Cheddar cheese </li>
</ul>
<p>
 
</p>
<ol class="org-ol">
<li>Preheat oven to 350 degrees F (175 degrees C). </li>
<li>In  a large skillet over medium-high heat, cook ground beef until no longer  pink. Stir in salsa, reduce heat, and simmer 20 minutes, or until  liquid is absorbed. Stir in beans, and heat through. </li>
<li>Spray  a 9x13 baking dish with cooking spray. Spread crushed tortilla chips in  dish, and then spoon beef mixture over chips. Spread sour cream over  beef, and sprinkle olives, green onion, and tomato over the sour cream.  Top with Cheddar cheese. </li>
<li>Bake in preheated oven for 30 minutes, or until hot and bubbly. </li>
</ol>
</div>
</div>

<div id="outline-container-orga627ce5" class="outline-3">
<h3 id="orga627ce5"><span class="section-number-3">1.23</span> Black pepper beef</h3>
<div class="outline-text-3" id="text-1-23">
<p>
<a href="https://schoolofwok.co.uk/tips-and-recipes/black-pepper-beef">Link</a>
</p>
</div>
</div>

<div id="outline-container-orgaa14206" class="outline-3">
<h3 id="orgaa14206"><span class="section-number-3">1.24</span> Wraps</h3>
<div class="outline-text-3" id="text-1-24">
</div>
<div id="outline-container-org3215b86" class="outline-4">
<h4 id="org3215b86"><span class="section-number-4">1.24.1</span> Kipfilet variant </h4>
<div class="outline-text-4" id="text-1-24-1">
<ul class="org-ul">
<li>kipfilet (of gerookte kipfilet) </li>
<li>paar plakjes komkommer </li>
<li>halve bosui </li>
<li>snufje peper </li>
</ul>
</div>
</div>

<div id="outline-container-org36d8bbc" class="outline-4">
<h4 id="org36d8bbc"><span class="section-number-4">1.24.2</span> Groenten wrap </h4>
<div class="outline-text-4" id="text-1-24-2">
<ul class="org-ul">
<li>1/4 rode paprika </li>
<li>handje rucola </li>
<li>halve bosui </li>
<li>snufje peper </li>
<li>snufje chilipoeder </li>
</ul>
<p>
 
</p>
</div>
</div>
<div id="outline-container-orgdbf8a53" class="outline-4">
<h4 id="orgdbf8a53"><span class="section-number-4">1.24.3</span> Wrap met kip, sla en komkommer </h4>
<div class="outline-text-4" id="text-1-24-3">
<ul class="org-ul">
<li>1 tl roomkaas met kruiden </li>
<li>handje ijsbergsla/eikenblad melange </li>
<li>plakje kipfilet (of gerookte kip)</li>
<li>paar plakjes komkommer </li>
<li>snufje peper </li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf570419" class="outline-3">
<h3 id="orgf570419"><span class="section-number-3">1.25</span> Stokbrood met pittig gehakt</h3>
<div class="outline-text-3" id="text-1-25">
<p>
<a href="https://www.lekkerensimpel.com/pittig-stokbrood-met-gehakt/">Link</a>
</p>
</div>
</div>
