cooking.org
** Quesedillas :Vegan:Mexican:Cheese:
Ingredients: 
- Wraps 
- Cheese 
- Olive oil or Butter
 
Optional: 
- Bacon stukjes 
- Avocado 
- Sla 
- Lente uien 
- Tomatoes Diced 
- Prosciutto  

** Sweet and sour chicken :Chicken:Chinese:Frying:
[[https://www.youtube.com/watch?v=RUDPussbU04][Link]]

** Spicy Thai Basil chicken :Chicken:Thai:
[[https://foodwishes.blogspot.com/2017/04/spicy-thai-basil-chicken-my-pad-krapow.html][Link]] 
 
Ingredients: 
- 1 pound freshly chopped chicken thighs 
- 1/4 cup sliced shallots 
- 4 cloves garlic, minced 
- 2 tablespoons minced Thai chilies, Serrano, or other hot pepper 
- 1/3 cup chicken broth 
- 1 tablespoon soy sauce, or as needed 
- 1 tablespoon oyster sauce 
- 2 teaspoons fish sauce 
- 1 teaspoon white sugar 
- 1 teaspoon brown sugar 
- 1 bunch basil leaves, sliced very thin with a sharp knife (about a cup once sliced) 

** Garlic sauce
For the love of god don't put any lemon in it
Jesus fucking christ that's awful
[[https://fussfreeflavours.com/easy-kebab-shop-garlic-sauce-recipe/][Link]]

| Amount | Ingredient   |
|--------+--------------|
| 2 tbsp | mayonnaise   |
| 2 tbsp | yoghurt      |
| 1      | clove garlic |
|--------+--------------|

1. Boil a kettle of water. Slice the garlic thinly, and transfer to a sieve. Pour the kettle of boiled water over the garlic
2. With the back of a knife, crush the garlic with a pinch of salt into a paste.
3. Mix garlic, mayonnaise and yoghurt. Season to taste with salt and pepper.
