cooking.html

<div id="outline-container-orgb03ec40" class="outline-3">
<h3 id="orgb03ec40"><span class="section-number-3">1.26</span> Quesedillas</h3>
<div class="outline-text-3" id="text-1-26">
<p>
Ingredients: 
</p>
<ul class="org-ul">
<li>Wraps </li>
<li>Cheese </li>
<li>Olive oil or Butter</li>
</ul>
<p>
 
Optional: 
</p>
<ul class="org-ul">
<li>Bacon stukjes </li>
<li>Avocado </li>
<li>Sla </li>
<li>Lente uien </li>
<li>Tomatoes Diced </li>
<li>Prosciutto  </li>
</ul>
</div>
</div>

<div id="outline-container-orgc2654ae" class="outline-3">
<h3 id="orgc2654ae"><span class="section-number-3">1.27</span> Sweet and sour chicken</h3>
<div class="outline-text-3" id="text-1-27">
<p>
<a href="https://www.youtube.com/watch?v=RUDPussbU04">Link</a>
</p>
</div>
</div>

<div id="outline-container-orgdac3044" class="outline-3">
<h3 id="orgdac3044"><span class="section-number-3">1.28</span> Spicy Thai Basil chicken</h3>
<div class="outline-text-3" id="text-1-28">
<p>
<a href="https://foodwishes.blogspot.com/2017/04/spicy-thai-basil-chicken-my-pad-krapow.html">Link</a> 
 
Ingredients: 
</p>
<ul class="org-ul">
<li>1 pound freshly chopped chicken thighs </li>
<li>1/4 cup sliced shallots </li>
<li>4 cloves garlic, minced </li>
<li>2 tablespoons minced Thai chilies, Serrano, or other hot pepper </li>
<li>1/3 cup chicken broth </li>
<li>1 tablespoon soy sauce, or as needed </li>
<li>1 tablespoon oyster sauce </li>
<li>2 teaspoons fish sauce </li>
<li>1 teaspoon white sugar </li>
<li>1 teaspoon brown sugar </li>
<li>1 bunch basil leaves, sliced very thin with a sharp knife (about a cup once sliced) </li>
</ul>
</div>
</div>
<div id="outline-container-orgf9b9c33" class="outline-3">
<h3 id="orgf9b9c33"><span class="section-number-3">1.29</span> Garlic sauce</h3>
<div class="outline-text-3" id="text-1-29">
<p>
For the love of god don&rsquo;t put any lemon in it
Jesus fucking christ that&rsquo;s awful
<a href="https://fussfreeflavours.com/easy-kebab-shop-garlic-sauce-recipe/">Link</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Amount</th>
<th scope="col" class="org-left">Ingredient</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">2 tbsp</td>
<td class="org-left">mayonnaise</td>
</tr>

<tr>
<td class="org-left">2 tbsp</td>
<td class="org-left">yoghurt</td>
</tr>

<tr>
<td class="org-left">1</td>
<td class="org-left">clove garlic</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li>Boil a kettle of water. Slice the garlic thinly, and transfer to a sieve. Pour the kettle of boiled water over the garlic</li>
<li>With the back of a knife, crush the garlic with a pinch of salt into a paste.</li>
<li>Mix garlic, mayonnaise and yoghurt. Season to taste with salt and pepper.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tobin Stultiens</p>
<p class="date">Created: 2021-03-23 di 16:32</p>
</div>
</body>
</html>
